---
kind: enumMember
id: F:Autodesk.Revit.DB.BehaviorType.EndCap
enum: Autodesk.Revit.DB.BehaviorType
source: html/48ef9278-5352-63e9-f556-d0abd4c31b48.htm
---
# Autodesk.Revit.DB.BehaviorType.EndCap

BehaviorType is End Cap